Revit 2026 API

# AttachmentLocation Enumeration

---

Represents the attachment location of the element.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum AttachmentLocation
```
```vb
Public Enumeration AttachmentLocation
```
```cpp
public enum class AttachmentLocation
```
```fsharp
type AttachmentLocation
```

| Member name | Value | Description |
| --- | --- | --- |
| Base | 0 | The attachment is made at the base of the element. |
| Top | 1 | The attachment is made at the top of the element. |

#### Reference

Autodesk.Revit.DB Namespace